OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1783.h
extern __at(0x039F) __sfr IOCEF;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCEF3               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __IOCEFbits_t;

extern __at(0x039F) volatile __IOCEFbits_t IOCEFbits;

#define _IOCEF3                 0x08

//==============================================================================


//==============================================================================
//        OPA1CON Bits

extern __at(0x0511) __sfr OPA1CON;

typedef union
  {
  struct
    {
    unsigned OPA1CH0            : 1;
    unsigned OPA1CH1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPA1SP             : 1;
    unsigned OPA1EN             : 1;
    };

  struct
    {
    unsigned OPA1CH             : 2;
    unsigned                    : 6;
    };
  } __OPA1CONbits_t;

extern __at(0x0511) volatile __OPA1CONbits_t OPA1CONbits;

#define _OPA1CH0                0x01
#define _OPA1CH1                0x02
#define _OPA1SP                 0x40
#define _OPA1EN                 0x80

//==============================================================================


//==============================================================================
//        OPA2CON Bits

extern __at(0x0513) __sfr OPA2CON;

typedef union
  {
  struct
    {
    unsigned OPA2CH0            : 1;
    unsigned OPA2CH1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OPA2SP             : 1;
    unsigned OPA2EN             : 1;
    };

  struct
    {
    unsigned OPA2CH             : 2;
    unsigned                    : 6;
    };
  } __OPA2CONbits_t;

extern __at(0x0513) volatile __OPA2CONbits_t OPA2CONbits;

#define _OPA2CH0                0x01
#define _OPA2CH1                0x02
#define _OPA2SP                 0x40
#define _OPA2EN                 0x80

//==============================================================================


//==============================================================================
//        CLKRCON Bits

extern __at(0x051A) __sfr CLKRCON;

typedef union
  {
  struct
    {
    unsigned CLKRDIV0           : 1;
    unsigned CLKRDIV1           : 1;
    unsigned CLKRDIV2           : 1;
    unsigned CLKRDC0            : 1;
    unsigned CLKRDC1            : 1;
    unsigned CLKRSLR            : 1;
    unsigned CLKROE             : 1;
    unsigned CLKREN             : 1;
    };

  struct
    {
    unsigned CLKRDIV            : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned CLKRDC             : 2;
    unsigned                    : 3;
    };
  } __CLKRCONbits_t;

extern __at(0x051A) volatile __CLKRCONbits_t CLKRCONbits;

#define _CLKRDIV0               0x01
#define _CLKRDIV1               0x02
#define _CLKRDIV2               0x04
#define _CLKRDC0                0x08
#define _CLKRDC1                0x10
#define _CLKRSLR                0x20
#define _CLKROE                 0x40
#define _CLKREN                 0x80

//==============================================================================


//==============================================================================
//        PSMC1CON Bits

extern __at(0x0811) __sfr PSMC1CON;

typedef union
  {
  struct
    {
    unsigned P1MODE0            : 1;
    unsigned P1MODE1            : 1;
    unsigned P1MODE2            : 1;
    unsigned P1MODE3            : 1;
    unsigned P1DBRE             : 1;
    unsigned P1DBFE             : 1;
    unsigned PSMC1LD            : 1;
    unsigned PSMC1EN            : 1;
    };

  struct
    {
    unsigned P1MODE             : 4;
    unsigned                    : 4;
    };
  } __PSMC1CONbits_t;

extern __at(0x0811) volatile __PSMC1CONbits_t PSMC1CONbits;

#define _P1MODE0                0x01
#define _P1MODE1                0x02
#define _P1MODE2                0x04
#define _P1MODE3                0x08
#define _P1DBRE                 0x10
#define _P1DBFE                 0x20
#define _PSMC1LD                0x40
#define _PSMC1EN                0x80

//==============================================================================


//==============================================================================
//        PSMC1MDL Bits

extern __at(0x0812) __sfr PSMC1MDL;

typedef union
  {
  struct
    {
    unsigned P1MSRC0            : 1;
    unsigned P1MSRC1            : 1;
    unsigned P1MSRC2            : 1;
    unsigned P1MSRC3            : 1;
    unsigned                    : 1;
    unsigned P1MDLBIT           : 1;
    unsigned P1MDLPOL           : 1;
    unsigned P1MDLEN            : 1;
    };

  struct
    {
    unsigned P1MSRC             : 4;
    unsigned                    : 4;
    };
  } __PSMC1MDLbits_t;

extern __at(0x0812) volatile __PSMC1MDLbits_t PSMC1MDLbits;

#define _P1MSRC0                0x01
#define _P1MSRC1                0x02
#define _P1MSRC2                0x04
#define _P1MSRC3                0x08
#define _P1MDLBIT               0x20
#define _P1MDLPOL               0x40
#define _P1MDLEN                0x80

//==============================================================================


//==============================================================================
//        PSMC1SYNC Bits

extern __at(0x0813) __sfr PSMC1SYNC;

typedef union
  {
  struct
    {
    unsigned P1SYNC0            : 1;
    unsigned P1SYNC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P1SYNC             : 2;
    unsigned                    : 6;
    };
  } __PSMC1SYNCbits_t;

extern __at(0x0813) volatile __PSMC1SYNCbits_t PSMC1SYNCbits;

#define _P1SYNC0                0x01
#define _P1SYNC1                0x02

//==============================================================================


//==============================================================================
//        PSMC1CLK Bits

extern __at(0x0814) __sfr PSMC1CLK;

typedef union
  {
  struct
    {
    unsigned P1CSRC0            : 1;
    unsigned P1CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P1CPRE0            : 1;
    unsigned P1CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P1CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P1CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC1CLKbits_t;

extern __at(0x0814) volatile __PSMC1CLKbits_t PSMC1CLKbits;

#define _P1CSRC0                0x01
#define _P1CSRC1                0x02
#define _P1CPRE0                0x10
#define _P1CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC1OEN Bits

extern __at(0x0815) __sfr PSMC1OEN;

typedef struct
  {
  unsigned P1OEA                : 1;
  unsigned P1OEB                : 1;
  unsigned P1OEC                : 1;
  unsigned P1OED                : 1;
  unsigned P1OEE                : 1;
  unsigned P1OEF                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1OENbits_t;

