OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1783.h
#define _PSMC2DBR0              0x01
#define _PSMC2DBR1              0x02
#define _PSMC2DBR2              0x04
#define _PSMC2DBR3              0x08
#define _PSMC2DBR4              0x10
#define _PSMC2DBR5              0x20
#define _PSMC2DBR6              0x40
#define _PSMC2DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC2DBF Bits

extern __at(0x084A) __sfr PSMC2DBF;

typedef struct
  {
  unsigned PSMC2DBF0            : 1;
  unsigned PSMC2DBF1            : 1;
  unsigned PSMC2DBF2            : 1;
  unsigned PSMC2DBF3            : 1;
  unsigned PSMC2DBF4            : 1;
  unsigned PSMC2DBF5            : 1;
  unsigned PSMC2DBF6            : 1;
  unsigned PSMC2DBF7            : 1;
  } __PSMC2DBFbits_t;

extern __at(0x084A) volatile __PSMC2DBFbits_t PSMC2DBFbits;

#define _PSMC2DBF0              0x01
#define _PSMC2DBF1              0x02
#define _PSMC2DBF2              0x04
#define _PSMC2DBF3              0x08
#define _PSMC2DBF4              0x10
#define _PSMC2DBF5              0x20
#define _PSMC2DBF6              0x40
#define _PSMC2DBF7              0x80

//==============================================================================


//==============================================================================
//        PSMC2BLKR Bits

extern __at(0x084B) __sfr PSMC2BLKR;

typedef struct
  {
  unsigned PSMC2BLKR0           : 1;
  unsigned PSMC2BLKR1           : 1;
  unsigned PSMC2BLKR2           : 1;
  unsigned PSMC2BLKR3           : 1;
  unsigned PSMC2BLKR4           : 1;
  unsigned PSMC2BLKR5           : 1;
  unsigned PSMC2BLKR6           : 1;
  unsigned PSMC2BLKR7           : 1;
  } __PSMC2BLKRbits_t;

extern __at(0x084B) volatile __PSMC2BLKRbits_t PSMC2BLKRbits;

#define _PSMC2BLKR0             0x01
#define _PSMC2BLKR1             0x02
#define _PSMC2BLKR2             0x04
#define _PSMC2BLKR3             0x08
#define _PSMC2BLKR4             0x10
#define _PSMC2BLKR5             0x20
#define _PSMC2BLKR6             0x40
#define _PSMC2BLKR7             0x80

//==============================================================================


//==============================================================================
//        PSMC2BLKF Bits

extern __at(0x084C) __sfr PSMC2BLKF;

typedef struct
  {
  unsigned PSMC2BLKF0           : 1;
  unsigned PSMC2BLKF1           : 1;
  unsigned PSMC2BLKF2           : 1;
  unsigned PSMC2BLKF3           : 1;
  unsigned PSMC2BLKF4           : 1;
  unsigned PSMC2BLKF5           : 1;
  unsigned PSMC2BLKF6           : 1;
  unsigned PSMC2BLKF7           : 1;
  } __PSMC2BLKFbits_t;

extern __at(0x084C) volatile __PSMC2BLKFbits_t PSMC2BLKFbits;

#define _PSMC2BLKF0             0x01
#define _PSMC2BLKF1             0x02
#define _PSMC2BLKF2             0x04
#define _PSMC2BLKF3             0x08
#define _PSMC2BLKF4             0x10
#define _PSMC2BLKF5             0x20
#define _PSMC2BLKF6             0x40
#define _PSMC2BLKF7             0x80

//==============================================================================


//==============================================================================
//        PSMC2FFA Bits

extern __at(0x084D) __sfr PSMC2FFA;

typedef union
  {
  struct
    {
    unsigned PSMC2FFA0          : 1;
    unsigned PSMC2FFA1          : 1;
    unsigned PSMC2FFA2          : 1;
    unsigned PSMC2FFA3          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PSMC2FFA           : 4;
    unsigned                    : 4;
    };
  } __PSMC2FFAbits_t;

extern __at(0x084D) volatile __PSMC2FFAbits_t PSMC2FFAbits;

#define _PSMC2FFA0              0x01
#define _PSMC2FFA1              0x02
#define _PSMC2FFA2              0x04
#define _PSMC2FFA3              0x08

//==============================================================================


//==============================================================================
//        PSMC2STR0 Bits

extern __at(0x084E) __sfr PSMC2STR0;

typedef struct
  {
  unsigned P2STRA               : 1;
  unsigned P2STRB               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC2STR0bits_t;

extern __at(0x084E) volatile __PSMC2STR0bits_t PSMC2STR0bits;

#define _P2STRA                 0x01
#define _P2STRB                 0x02

//==============================================================================


//==============================================================================
//        PSMC2STR1 Bits

extern __at(0x084F) __sfr PSMC2STR1;

typedef struct
  {
  unsigned P2HSMEN              : 1;
  unsigned P2LSMEN              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2SSYNC              : 1;
  } __PSMC2STR1bits_t;

extern __at(0x084F) volatile __PSMC2STR1bits_t PSMC2STR1bits;

#define _P2HSMEN                0x01
#define _P2LSMEN                0x02
#define _P2SSYNC                0x80

//==============================================================================


//==============================================================================
//        STATUS_SHAD Bits

extern __at(0x0FE4) __sfr STATUS_SHAD;

typedef struct
  {
  unsigned C_SHAD               : 1;
  unsigned DC_SHAD              : 1;
  unsigned Z_SHAD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __STATUS_SHADbits_t;

extern __at(0x0FE4) volatile __STATUS_SHADbits_t STATUS_SHADbits;

#define _C_SHAD                 0x01
#define _DC_SHAD                0x02
#define _Z_SHAD                 0x04

//==============================================================================

